examples/flows/agentic/compiled/plan_and_execute/flow.mmd
flowchart TD
    %% Flow: plan_and_execute

    executor[executor]
    planner[planner]
    re_planner[re_planner]
    router_plan_and_execute_line_49_seq_4{{router_plan_and_execute_line_49_seq_4}}
    router_plan_and_execute_line_54_while_2{{router_plan_and_execute_line_54_while_2}}
    router_plan_and_execute_line_59_if_3{{router_plan_and_execute_line_59_if_3}}
    router_plan_and_execute_line_62_seq_1{{router_plan_and_execute_line_62_seq_1}}
    start_plan_and_execute([start_plan_and_execute])
    synthesizer([synthesizer])

    start_plan_and_execute --> router_plan_and_execute_line_49_seq_4
    router_plan_and_execute_line_62_seq_1 --> synthesizer
    router_plan_and_execute_line_59_if_3 -->|p['current_step'] < len(p.get('plan', []))| re_planner
    router_plan_and_execute_line_54_while_2 -->|p['current_step'] < len(p.get('plan', []))| executor
    executor --> router_plan_and_execute_line_59_if_3
    router_plan_and_execute_line_54_while_2 -->|not (p['current_step'] < len(p.get('plan', [])))| router_plan_and_execute_line_62_seq_1
    router_plan_and_execute_line_49_seq_4 --> planner
    planner --> router_plan_and_execute_line_54_while_2
    re_planner --> router_plan_and_execute_line_54_while_2
